tap "jesseduffield/lazygit"
# Apjanke's fork of the classic cowsay project
brew "cowsay"
# Top-like interface for container metrics
brew "ctop"
# Modern, maintained replacement for ls
brew "eza"
# Infamous electronic fortune-cookie generator
brew "fortune"
# Command-line fuzzy finder written in Go
brew "fzf"
# GitHub command-line tool
brew "gh"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Package manager for the Lua programming language
brew "luarocks"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Fast, disk space efficient package manager
brew "pnpm"
# Library for command-line editing
brew "readline"
# Python version management
brew "pyenv"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Terminal multiplexer
brew "tmux"
# General-purpose data compression with high compression ratio
brew "xz"
# A simple terminal UI for git commands, written in Go
brew "jesseduffield/lazygit/lazygit"
cask "font-hack-nerd-font"
vscode "vscodevim.vim"
